{
  "Header": [
    "home",
    "work",
    "blogs",
    "contact"
  ],
  "intro": {
    "intro_para_1": "I'm a frontend developer, optimist, and community builder. I currently work as the software developer at Easebuzz, where I help teach the Next.js community, an open-source web framework built with React.",
    "intro_para_2": "I create educational content for developers, writing about web development, JavaScript and TypeScript, React and Next.js, and more. This comes in all forms: blog posts, videos, tweets, conference talks, and workshops. You can watch some of my favorites below.",
    "intro_para_3": "Over the past decade, I've written content on my blog and newsletter. I try to keep things simple. You'll find writing about technologies I'm interested in at the time, or how I'm learning and growing in my career, sharing knowledge along the way."
  },
  "DataCard": {
    "title": {
      "title_1": "What makes a great developer experience?",
      "title_2": "Developer Conundrum"
    },
    "subtitle": {
      "subtitle_1": "54,007 views",
      "subtitle_2": "24,030 views"
    }
  },
  "LanguageBox": [
    "React",
    "Flutter",
    "Node",
    "Django"
  ],
  "Work": {
    "work_para_1": "On a mission to build products developers love, and along the way, teach the next generation of developers. Here's a summary of my work so far."
  },
  "Experience": {
    "Current": {
      "company": "Easebuzz",
      "title": "Software Developer",
      "info_para_1": "I joined Easebuzz early to grow ePOS application and our developer community. I built our Developer Support team to teach our developers about making our products efficient.",
      "job_points": [
        "In 2022, I was hired to build a scalable mobile app for iOS and Android using a single codebase. I took ownership of the product and integrated key architectures.",
        "I also played a key role in promoting a merchant-first initiative, collaborating closely with the product team to curate comprehensive documentation for our Mobile SDKs.",
        "In 2023, I was promoted to Full Stack Developer, where I took on the additional responsibility of working on our Payment Gateway project, built using the Django framework, while also contributing to the expansion of our ePOS modules.."
      ],
      "info_para_2": "Since I joined Easebuzz in 2022, ePOS active users have grown 1000%, now at ~10k. My initiative of creating a documentation suiting to the merchants reduced support queries by 50%. It's used by Shopify, ZOHO, WIX, IRCTC, Tally, BigBasket, and more."
    },
    "Previous": [
      {
        "prev_job": "Wikasta Business",
        "prev_title": "Product - SEO",
        "prev_job_info": [
          "Hy-Vee, an almost 100-year-old grocery chain in the United States, wanted to build a new version of their digital storefront. I joined a team of product engineers working across web and mobile to rebuild their legacy .NET application (~500k MAU) with React and React Native.",
          "On the frontend, I led our move from a custom webpack and React configuration to Next.js and the latest React patterns. In the process, I shared my learnings online, helping educate members of the React and Next.js community by creating courses.",
          "Throughout my two years, I was able to work on some hard problems: decoupling a decade old monolith into microservices, working with a federated GraphQL API, learning and occasionally managing a Kubernetes cluster, building and implementing a design system, incrementally migrating individual components and routes to a new framework and infrastructure, and more."
        ]
      },
      {
        "prev_job": "Freelancing",
        "prev_title": "Web Developer, 2019 — 2022",
        "prev_job_info": [
          "Workiva ($WK) is a cloud platform for data reporting and compliance. During my time at Workiva, I gained my first production experience using React. I worked on tooling to help predict and alert and regressions in our SaaS platform, building a product similar to open-source tools like Sentry."
        ]
      }
    ]
  },
  "Blogs": [
    {
      "title": "On Developer Marketing",
      "views": "Aug 2024"
    },
    {
      "title": "Next JS",
      "views": "Jun 2024"
    },
    {
      "title": "The Easebuzz experience",
      "views": "Mar 2024"
    },
    {
      "title": "FinTech - The new Tech",
      "views": "Jan 2024"
    },
    {
      "title": "The Easebuzz experience",
      "views": "Nov 2023"
    },
    {
      "title": "Experimenting with React Native",
      "views": "Feb 2023"
    },
    {
      "title": "ePOS Application",
      "views": "Sep 2022"
    },
    {
      "title": "ePOS Application",
      "views": "May 2021"
    },
    {
      "title": "SDK?? How to develop a kit?",
      "views": "Dec 2020"
    },
    {
      "title": "What is Internet?",
      "views": "Jul 2020"
    },
    {
      "title": "Why start with C language?",
      "views": "Jun 2020"
    },
    {
      "title": "MySQL or NoSQL",
      "views": "Apr 2020"
    },
    {
      "title": "Code editor. Does it matter?",
      "views": "Aug 2019"
    },
    {
      "title": "SEO",
      "views": "Mar 2019"
    }
  ]
}