{
  "Header": [
    "home",
    "work",
    "contact"
  ],
  "intro": {
    "intro_para_1": "I'm a frontend developer, optimist, and tech enthusiast. I currently work as the software developer at Easebuzz, where I help develop the mobile applications and Payment Gateway frameworks, a multi-platform framework built with Swift.",
    "intro_para_2": "I have contributed extensively in our ePOS mobile application, adding advanced tools and features like internationalization. Making our app available to many local businesses across India.",
    "intro_para_3": "Over the past 2 years, I've developed frameworks using Swift for the merchants who want to integrate our Payment Gateway into their applications.I am currently organizing my blogs which will be available soon on this website, they include tech news or how I'm learning and growing in my career, sharing knowledge along the way."
  },
  "DataCard": {
    "title": {
      "title_1": "What makes a great developer experience?",
      "title_2": "Developer Conundrum"
    },
    "subtitle": {
      "subtitle_1": "54,007 views",
      "subtitle_2": "24,030 views"
    }
  },
  "LanguageBox": [
    "React",
    "Flutter",
    "Node",
    "Django"
  ],
  "Work": {
    "work_para_1": "On a mission to build products developers love, and along the way, teach the next generation of developers. Here's a summary of my work so far."
  },
  "Experience": {
    "Current": {
      "company": "Easebuzz",
      "title": "Software Developer",
      "info_para_1": "I joined Easebuzz early to grow ePOS application and our developer community. I built our Developer Support team to teach our developers about making our products efficient.",
      "job_points": [
        "In 2024, I was promoted to SDE 2 - Fullstack Developer as i endued my expertise in working with DJango framework. I wrote test-cases for the 'Seamless APIs' in the gateway team. Focusing on providing end to end clarity on our Payment Gateway APIs.",
        "In 2023, I was provided the sole ownership of out ePOS product, where I took on the additional responsibility of expanding our users of ePOS app, built using the React Native framework. I added features like internationalization, a user focused UI, and starting a culture of writing cleaner code.",
        "I also played a key role in promoting a merchant-first initiative, collaborating closely with the product team to curate comprehensive documentation for our Mobile SDKs.",
        "In 2022, I was hired to build a scalable mobile app for iOS and Android using a single codebase. I took ownership of the product and integrated key architectures."
      ],
      "info_para_2": "Since I joined Easebuzz in 2022, ePOS active users have grown 1000%, now at ~10k. My initiative of creating a documentation suiting to the merchants reduced support queries by 50%. It's used by Shopify, ZOHO, WIX, IRCTC, Tally, BigBasket, CDHL and more."
    },
    "Previous": [
      {
        "prev_job": "Wikasta Business",
        "prev_title": "Product - SEO",
        "prev_job_info": [
          "I was a SEO manager. I worked to increase the visibility of the website to potential users. The task involved increasing the rating on google searches and writing creative blogs, a habit i have embodied at my current work too.",
          "On the frontend, I led a team on creating engaging posts and writing about new technologies. In the process, I shared my learnings online, helping educate members of the developer community by creating blogs on Wikasta.",
          "Throughout my internship period, I was able to work on some hard problems: how to attract users to stay on our page, learn about different languages and their pros or cons."
        ]
      },
      {
        "prev_job": "Freelancing",
        "prev_title": "Web Developer / Sales, 2020 — 2021",
        "prev_job_info": [
          "I always have wanted to create, collaborate and work on projects that people love. I have created many projects for free to empower small scale startups. But one special one comes to mind where I teamed up with my brother to create a delivery app for alcohol. It was a new initiative which propelled us into learning about many things that aren't visible from the outside. I had to get out of my comfort zone and approach shop owners across Mumbai metropolitan region to get them to sign with us. Sadly, we had to close down our project due to lack of funds and other bottlenecks."
        ]
      }
    ]
  },
  "Blogs": [
    {
      "title": "On Developer Marketing",
      "views": "Aug 2024"
    },
    {
      "title": "Next JS",
      "views": "Jun 2024"
    },
    {
      "title": "The Easebuzz experience",
      "views": "Mar 2024"
    },
    {
      "title": "FinTech - The new Tech",
      "views": "Jan 2024"
    },
    {
      "title": "The Easebuzz experience",
      "views": "Nov 2023"
    },
    {
      "title": "Experimenting with React Native",
      "views": "Feb 2023"
    },
    {
      "title": "ePOS Application",
      "views": "Sep 2022"
    },
    {
      "title": "ePOS Application",
      "views": "May 2021"
    },
    {
      "title": "SDK?? How to develop a kit?",
      "views": "Dec 2020"
    },
    {
      "title": "What is Internet?",
      "views": "Jul 2020"
    },
    {
      "title": "Why start with C language?",
      "views": "Jun 2020"
    },
    {
      "title": "MySQL or NoSQL",
      "views": "Apr 2020"
    },
    {
      "title": "Code editor. Does it matter?",
      "views": "Aug 2019"
    },
    {
      "title": "SEO",
      "views": "Mar 2019"
    }
  ],
  "Contact": [
    "Name",
    "Email",
    "Message"
  ],
  "Form": {
    "name": "Name",
    "email": "Email",
    "message": "Message",
    "submit": "Submit"
  }
}